; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-4-21)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-5 - location
	p2-1 - location
	p2-4 - location
	p3-0 - location
	p3-5 - location
	p3-6 - location
	p4-3 - location
	p6-2 - location
	p6-4 - location
	p6-5 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s6)
	(at driver3 s3)
	(at driver4 s6)
	(at driver5 s4)
	(at driver6 s5)
	(at driver7 s3)
	(at driver8 s1)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at package1 s6)
	(at package2 s4)
	(at package3 s2)
	(at package4 s3)
	(at package5 s3)
	(at package6 s1)
	(at package7 s3)
	(at package8 s2)
	(at package9 s4)
	(at package10 s2)
	(at package11 s4)
	(at package12 s6)
	(at package13 s2)
	(at package14 s1)
	(at package15 s3)
	(at package16 s4)
	(at package17 s4)
	(at package18 s5)
	(at package19 s3)
	(at package20 s0)
	(at package21 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(link s0 s5)
	(link s5 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s1)
	(link s1 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s2)
	(link s2 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s6)
	(link s6 s5)
	(link s6 s1)
	(link s1 s6)
	(link s6 s4)
	(link s4 s6)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s6)
	(at driver4 s1)
	(at driver6 s2)
	(at driver7 s5)
	(at driver8 s0)
	(at truck1 s6)
	(at truck3 s5)
	(at package1 s1)
	(at package2 s1)
	(at package3 s5)
	(at package4 s4)
	(at package5 s0)
	(at package6 s2)
	(at package8 s4)
	(at package9 s5)
	(at package10 s0)
	(at package11 s0)
	(at package12 s4)
	(at package13 s0)
	(at package14 s4)
	(at package15 s0)
	(at package16 s1)
	(at package17 s5)
	(at package18 s0)
	(at package19 s4)
	(at package20 s0)
	(at package21 s5)
	))


)

; plan
1. (board-truck driver1 s0 truck2)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 28
2. (drive-truck driver1 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 1 of 28
3. (drive-truck driver1 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 1 of 28
4. (load-truck s3 package5 truck2)
   deleted: (at package5 s3)
   added: (in package5 truck2)
   goals met: 1 of 28
5. (load-truck s3 package4 truck2)
   deleted: (at package4 s3)
   added: (in package4 truck2)
   goals met: 1 of 28
6. (drive-truck driver1 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 1 of 28
7. (load-truck s4 package9 truck2)
   deleted: (at package9 s4)
   added: (in package9 truck2)
   goals met: 1 of 28
8. (drive-truck driver1 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 1 of 28
9. (load-truck s3 package19 truck2)
   deleted: (at package19 s3)
   added: (in package19 truck2)
   goals met: 1 of 28
10. (drive-truck driver1 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 1 of 28
11. (unload-truck s4 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s4)
   goals met: 2 of 28
12. (drive-truck driver1 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 2 of 28
13. (unload-truck s0 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   goals met: 3 of 28
14. (load-truck s1 package14 truck4)
   deleted: (at package14 s1)
   added: (in package14 truck4)
   goals met: 3 of 28
15. (board-truck driver8 s1 truck4)
   deleted: (at driver8 s1) (empty truck4)
   added: (driving driver8 truck4)
   goals met: 3 of 28
16. (drive-truck driver1 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 3 of 28
17. (load-truck s4 package2 truck2)
   deleted: (at package2 s4)
   added: (in package2 truck2)
   goals met: 3 of 28
18. (unload-truck s4 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s4)
   goals met: 4 of 28
19. (drive-truck driver1 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 4 of 28
20. (load-truck s6 package12 truck2)
   deleted: (at package12 s6)
   added: (in package12 truck2)
   goals met: 4 of 28
21. (drive-truck driver1 s6 s4 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   goals met: 4 of 28
22. (load-truck s4 package17 truck2)
   deleted: (at package17 s4)
   added: (in package17 truck2)
   goals met: 4 of 28
23. (drive-truck driver1 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 4 of 28
24. (load-truck s6 package1 truck2)
   deleted: (at package1 s6)
   added: (in package1 truck2)
   goals met: 4 of 28
25. (drive-truck driver8 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 4 of 28
26. (drive-truck driver1 s6 s1 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   goals met: 4 of 28
27. (load-truck s1 package6 truck2)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   goals met: 4 of 28
28. (drive-truck driver1 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 4 of 28
29. (load-truck s3 package15 truck2)
   deleted: (at package15 s3)
   added: (in package15 truck2)
   goals met: 4 of 28
30. (drive-truck driver1 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 4 of 28
31. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 4 of 28
32. (unload-truck s0 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s0)
   goals met: 5 of 28
33. (load-truck s2 package8 truck4)
   deleted: (at package8 s2)
   added: (in package8 truck4)
   goals met: 5 of 28
34. (load-truck s2 package3 truck4)
   deleted: (at package3 s2)
   added: (in package3 truck4)
   goals met: 5 of 28
35. (load-truck s2 package21 truck4)
   deleted: (at package21 s2)
   added: (in package21 truck4)
   goals met: 5 of 28
36. (drive-truck driver8 s2 s0 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   goals met: 5 of 28
37. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 5 of 28
38. (unload-truck s1 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   goals met: 6 of 28
39. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 6 of 28
40. (unload-truck s2 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s2)
   goals met: 7 of 28
41. (drive-truck driver1 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 7 of 28
42. (unload-truck s5 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s5)
   goals met: 8 of 28
43. (load-truck s5 package18 truck2)
   deleted: (at package18 s5)
   added: (in package18 truck2)
   goals met: 8 of 28
44. (drive-truck driver1 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 8 of 28
45. (unload-truck s0 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s0)
   goals met: 9 of 28
46. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 9 of 28
47. (unload-truck s1 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   goals met: 10 of 28
48. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 10 of 28
49. (load-truck s2 package13 truck2)
   deleted: (at package13 s2)
   added: (in package13 truck2)
   goals met: 10 of 28
50. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 10 of 28
51. (drive-truck driver1 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 10 of 28
52. (load-truck s4 package16 truck2)
   deleted: (at package16 s4)
   added: (in package16 truck2)
   goals met: 10 of 28
53. (drive-truck driver1 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 10 of 28
54. (unload-truck s0 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s0)
   goals met: 11 of 28
55. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 11 of 28
56. (unload-truck s1 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s1)
   goals met: 12 of 28
57. (walk driver2 s6 p3-6)
   deleted: (at driver2 s6)
   added: (at driver2 p3-6)
   goals met: 12 of 28
58. (walk driver2 p3-6 s3)
   deleted: (at driver2 p3-6)
   added: (at driver2 s3)
   goals met: 13 of 28
59. (walk driver3 s3 p3-6)
   deleted: (at driver3 s3)
   added: (at driver3 p3-6)
   goals met: 13 of 28
60. (walk driver3 p3-6 s6)
   deleted: (at driver3 p3-6)
   added: (at driver3 s6)
   goals met: 14 of 28
61. (walk driver4 s6 p6-2)
   deleted: (at driver4 s6)
   added: (at driver4 p6-2)
   goals met: 14 of 28
62. (walk driver4 p6-2 s2)
   deleted: (at driver4 p6-2)
   added: (at driver4 s2)
   goals met: 14 of 28
63. (walk driver4 s2 p2-1)
   deleted: (at driver4 s2)
   added: (at driver4 p2-1)
   goals met: 14 of 28
64. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 14 of 28
65. (load-truck s2 package10 truck2)
   deleted: (at package10 s2)
   added: (in package10 truck2)
   goals met: 14 of 28
66. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 14 of 28
67. (unload-truck s0 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s0)
   goals met: 15 of 28
68. (drive-truck driver1 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 15 of 28
69. (unload-truck s4 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s4)
   goals met: 16 of 28
70. (load-truck s4 package11 truck2)
   deleted: (at package11 s4)
   added: (in package11 truck2)
   goals met: 16 of 28
71. (drive-truck driver1 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 16 of 28
72. (unload-truck s0 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s0)
   goals met: 17 of 28
73. (drive-truck driver1 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 17 of 28
74. (unload-truck s5 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s5)
   goals met: 18 of 28
75. (walk driver4 p2-1 s1)
   deleted: (at driver4 p2-1)
   added: (at driver4 s1)
   goals met: 19 of 28
76. (walk driver7 s3 p3-5)
   deleted: (at driver7 s3)
   added: (at driver7 p3-5)
   goals met: 19 of 28
77. (walk driver7 p3-5 s5)
   deleted: (at driver7 p3-5)
   added: (at driver7 s5)
   goals met: 20 of 28
78. (disembark-truck driver1 s5 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s5) (empty truck2)
   goals met: 20 of 28
79. (board-truck driver6 s5 truck2)
   deleted: (at driver6 s5) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 20 of 28
80. (drive-truck driver6 s5 s2 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   goals met: 20 of 28
81. (disembark-truck driver6 s2 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s2) (empty truck2)
   goals met: 21 of 28
82. (drive-truck driver8 s0 s4 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   goals met: 21 of 28
83. (unload-truck s4 package8 truck4)
   deleted: (in package8 truck4)
   added: (at package8 s4)
   goals met: 22 of 28
84. (drive-truck driver8 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 22 of 28
85. (drive-truck driver8 s0 s5 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   goals met: 22 of 28
86. (unload-truck s5 package3 truck4)
   deleted: (in package3 truck4)
   added: (at package3 s5)
   goals met: 23 of 28
87. (drive-truck driver8 s5 s0 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s0)
   goals met: 23 of 28
88. (disembark-truck driver8 s0 truck4)
   deleted: (driving driver8 truck4)
   added: (at driver8 s0) (empty truck4)
   goals met: 24 of 28
89. (board-truck driver8 s0 truck3)
   deleted: (at driver8 s0) (empty truck3)
   added: (driving driver8 truck3)
   goals met: 23 of 28
90. (unload-truck s0 package21 truck4)
   deleted: (in package21 truck4)
   added: (at package21 s0)
   goals met: 23 of 28
91. (disembark-truck driver8 s0 truck3)
   deleted: (driving driver8 truck3)
   added: (at driver8 s0) (empty truck3)
   goals met: 24 of 28
92. (board-truck driver8 s0 truck4)
   deleted: (at driver8 s0) (empty truck4)
   added: (driving driver8 truck4)
   goals met: 23 of 28
93. (drive-truck driver8 s0 s4 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   goals met: 23 of 28
94. (unload-truck s4 package14 truck4)
   deleted: (in package14 truck4)
   added: (at package14 s4)
   goals met: 24 of 28
95. (board-truck driver4 s1 truck1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 23 of 28
96. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 23 of 28
97. (load-truck s0 package21 truck1)
   deleted: (at package21 s0)
   added: (in package21 truck1)
   goals met: 23 of 28
98. (disembark-truck driver4 s0 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s0) (empty truck1)
   goals met: 23 of 28
99. (board-truck driver4 s0 truck3)
   deleted: (at driver4 s0) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 23 of 28
100. (unload-truck s0 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s0)
   goals met: 23 of 28
101. (drive-truck driver4 s0 s5 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 24 of 28
102. (walk driver2 s3 p3-0)
   deleted: (at driver2 s3)
   added: (at driver2 p3-0)
   goals met: 23 of 28
103. (drive-truck driver4 s5 s0 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   goals met: 22 of 28
104. (drive-truck driver8 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 22 of 28
105. (load-truck s0 package21 truck4)
   deleted: (at package21 s0)
   added: (in package21 truck4)
   goals met: 22 of 28
106. (drive-truck driver8 s0 s5 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   goals met: 22 of 28
107. (disembark-truck driver4 s0 truck3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s0) (empty truck3)
   goals met: 22 of 28
108. (drive-truck driver8 s5 s0 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s0)
   goals met: 22 of 28
109. (disembark-truck driver8 s0 truck4)
   deleted: (driving driver8 truck4)
   added: (at driver8 s0) (empty truck4)
   goals met: 23 of 28
110. (board-truck driver4 s0 truck4)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 23 of 28
111. (drive-truck driver4 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 23 of 28
112. (drive-truck driver4 s1 s5 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   goals met: 23 of 28
113. (unload-truck s5 package21 truck4)
   deleted: (in package21 truck4)
   added: (at package21 s5)
   goals met: 24 of 28
114. (drive-truck driver4 s5 s1 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   goals met: 24 of 28
115. (disembark-truck driver4 s1 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 25 of 28
116. (board-truck driver8 s0 truck3)
   deleted: (at driver8 s0) (empty truck3)
   added: (driving driver8 truck3)
   goals met: 24 of 28
117. (drive-truck driver8 s0 s5 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 25 of 28
118. (walk driver2 p3-0 s0)
   deleted: (at driver2 p3-0)
   added: (at driver2 s0)
   goals met: 25 of 28
119. (board-truck driver2 s0 truck1)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 25 of 28
120. (drive-truck driver2 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 25 of 28
121. (drive-truck driver2 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 26 of 28
122. (disembark-truck driver2 s6 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s6) (empty truck1)
   goals met: 26 of 28
123. (walk driver2 s6 p3-6)
   deleted: (at driver2 s6)
   added: (at driver2 p3-6)
   goals met: 26 of 28
124. (walk driver2 p3-6 s3)
   deleted: (at driver2 p3-6)
   added: (at driver2 s3)
   goals met: 27 of 28
125. (disembark-truck driver8 s5 truck3)
   deleted: (driving driver8 truck3)
   added: (at driver8 s5) (empty truck3)
   goals met: 27 of 28
126. (walk driver8 s5 p0-5)
   deleted: (at driver8 s5)
   added: (at driver8 p0-5)
   goals met: 27 of 28
127. (walk driver8 p0-5 s0)
   deleted: (at driver8 p0-5)
   added: (at driver8 s0)
   goals met: 28 of 28
